/*Задача 25: Напишите цикл, 
который принимает на вход два числа (A и B) 
и возводит число A в натуральную степень B.*/
Task25.Task250();

/*Задача 27: Напишите программу, 
которая принимает на вход число 
и выдаёт сумму цифр в числе.*/
Task27.Task270();

/*Задача 29: Напишите программу, 
которая задаёт массив из N элементов (из диапазона [0-14] ) 
и выводит на экран десятичное представление числа, 
записанного в СС по основанию 15*/
Task29.Task290();

/*Задача 34: Задайте массив 
заполненный случайными положительными трёхзначными числами. 
Напишите программу, которая покажет количество чётных чисел в массиве.*/
Task34.Task340();

/*Задача 36: Задайте одномерный массив, 
заполненный случайными числами. 
Найдите сумму элементов, стоящих на нечётных позициях.*/
Task36.Task360();

/*Задача 38: Задайте массив вещественных чисел. 
Найдите разницу между максимальным и минимальным элементов массива.*/
Task38.Task380();

/*Задача 41: Пользователь вводит с клавиатуры M чисел. 
Посчитайте, сколько чисел больше 0 ввёл пользователь.*/
Task41.Task410();

/*Задача 43: Напишите программу, 
которая найдёт точку пересечения двух прямых, 
заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; 
значения b1, k1, b2 и k2 задаются пользователем.*/
Task43.Task430();