/*Задача 25: Напишите цикл, 
который принимает на вход два числа (A и B) 
и возводит число A в натуральную степень B.*/
Task25.Task250();

/*Задача 27: Напишите программу, 
которая принимает на вход число 
и выдаёт сумму цифр в числе.*/
Task27.Task270();

/*Задача 29: Напишите программу, 
которая задаёт массив из N элементов (из диапазона [0-14] ) 
и выводит на экран десятичное представление числа, 
записанного в СС по основанию 15*/
Task29.Task290();

/*Задача 34: Задайте массив 
заполненный случайными положительными трёхзначными числами. 
Напишите программу, которая покажет количество чётных чисел в массиве.*/
Task34.Task340();

/*Задача 36: Задайте одномерный массив, 
заполненный случайными числами. 
Найдите сумму элементов, стоящих на нечётных позициях.*/
Task36.Task360();

/*Задача 38: Задайте массив вещественных чисел. 
Найдите разницу между максимальным и минимальным элементов массива.*/
Task38.Task380();

/*Задача 41: Пользователь вводит с клавиатуры M чисел. 
Посчитайте, сколько чисел больше 0 ввёл пользователь.*/
Task41.Task410();

/*Задача 43: Напишите программу, 
которая найдёт точку пересечения двух прямых, 
заданных уравнениями y = k1 * x + b1, y = k2 * x + b2; 
значения b1, k1, b2 и k2 задаются пользователем.*/
Task43.Task430();


/*Задача 47. Задайте двумерный массив размером m×n, 
заполненный случайными вещественными числами.
m = 3, n = 4.*/
Task47.Task470();

/*Задача 50. Напишите программу, 
которая на вход принимает позиции элемента в двумерном массиве, 
и возвращает значение этого элемента или же указание, 
что такого элемента нет.*/
Task50.Task500();

/*Задача 52. Задайте двумерный массив из целых чисел. 
Найдите среднее арифметическое элементов в каждом столбце.*/
Task52.Task520();

/*Задача 54. Задайте двумерный массив. 
Напишите программу, которая упорядочит 
по убыванию элементы каждой строки двумерного массива.*/
Task54.Task540();

/*Задача 56. Задайте прямоугольный двумерный массив. 
Напишите программу, 
которая будет находить строку с наименьшей суммой элементов.*/
Task56.Task560();

/*Задача 60. ...Сформируйте трёхмерный массив 
из неповторяющихся двузначных чисел. 
Напишите программу, которая будет построчно выводить массив, 
добавляя индексы каждого элемента.*/
Task60.Task600();

/*Задача 64: Задайте значение N. Напишите программу, 
которая выведет все натуральные числа в промежутке от N до 1. 
Выполнить с помощью рекурсии.*/
Task64.Task640();

/*Задача 66: Задайте значения M и N. Напишите программу, 
которая найдёт сумму натуральных элементов в промежутке от M до N.*/
Task66.Task660();

/*Задача 68: Напишите программу вычисления функции Аккермана 
с помощью рекурсии. Даны два неотрицательных числа m и n.*/
Task68.Task680();